{"config": {"layers": [{"config": {"activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_1", "bias_regularizer": null, "padding": "valid", "kernel_constraint": null, "strides": [1, 1], "kernel_size": [3, 3], "dilation_rate": [1, 1], "batch_input_shape": [null, 160, 60, 3], "activation": "relu", "dtype": "float32", "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "filters": 32}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_1", "trainable": true, "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_2", "bias_regularizer": null, "padding": "valid", "kernel_constraint": null, "strides": [1, 1], "kernel_size": [3, 3], "dilation_rate": [1, 1], "activation": "relu", "activity_regularizer": null, "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "filters": 32}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_2", "trainable": true, "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "bias_regularizer": null, "kernel_constraint": null, "units": 128, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "bias_constraint": null, "trainable": true, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2", "bias_regularizer": null, "kernel_constraint": null, "units": 1, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "sigmoid", "bias_constraint": null, "trainable": true, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}], "name": "sequential_1"}, "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.4"}